Repository: carlosindriago/woospeed
Catalog: languages/woospeed-analytics-*.po
Languages: es_es

source: WooSpeed Analytics
es_es: WooSpeed Análisis

source: Speed Analytics
es_es: Speed Análisis

source: Dashboard
es_es: Panel de Control

source: Data Generator
es_es: Generador de Datos

source: This will generate 5,000 real orders. Continue?
es_es: Esto generará 5,000 pedidos reales. ¿Continuar?

source: ✅ Process Complete! 5,000 Orders Generated.
es_es: ✅ ¡Proceso Terminado! 5,000 Pedidos Generados.

source: Network error. Try again.
es_es: Error de red. Intenta de nuevo.

source: Error in process:
es_es: Error en el proceso:

source: Speed Demo Product #%d
es_es: Producto Demo Speed #%d

source: Automatically generated description for load testing.
es_es: Descripción generada automáticamente para pruebas de carga.

source: Test product.
es_es: Producto de prueba.

source: Automatically generated test order.
es_es: Orden de prueba generada automáticamente.

source: Batch of %d orders completed.
es_es: Batch de %d órdenes completado.

source: Performance Overview
es_es: Resumen de Rendimiento

source: Last 7 Days
es_es: Últimos 7 días

source: Last 30 Days
es_es: Últimos 30 días

source: Last Quarter
es_es: Último Trimestre

source: This Year
es_es: Este Año

source: Total Revenue
es_es: Ingresos Totales

source: Orders
es_es: Pedidos

source: Avg Order Value
es_es: Ticket Promedio

source: Max Order
es_es: Pedido Máximo

source: Sales Trend
es_es: Tendencia de Ventas

source: Top Products
es_es: Top Productos

source: Loading...
es_es: Cargando...

source: Engine
es_es: Motor

source: Flat Table + Raw SQL
es_es: Tabla Plana + Raw SQL

source: Load Time
es_es: Tiempo de Carga

source: 🛠️ Stress-Test Data Generator
es_es: 🛠️ Generador de Datos Stress-Test

source: Use these tools to simulate high-traffic activity on the store.
es_es: Utilice estas herramientas para simular actividad de alto tráfico en la tienda.

source: ✅ Operation Complete:
es_es: ✅ Operación Completada:

source: Generated <b>%s</b> items
es_es: Generados <b>%s</b> items

source: Type: %s
es_es: Tipo: %s

source: 🧹 Cleanup Complete:
es_es: 🧹 Limpieza Completada:

source: Deleted <b>%s</b> test records.
es_es: Eliminados <b>%s</b> registros de prueba.

source: 🔄 Migration Complete:
es_es: 🔄 Migración Completada:

source: Synchronized <b>%s</b> items to leaderboard table.
es_es: Sincronizados <b>%s</b> items a la tabla de leaderboard.

source: ⚠️ Migration Required
es_es: ⚠️ Migración Requerida

source: You have <b>%s</b> orders in the system, but only <b>%s</b> have their products synchronized for "Top Products".
es_es: Tienes <b>%s</b> órdenes en el sistema, pero solo <b>%s</b> tienen sus productos sincronizados para "Top Productos".

source: This will synchronize items for all existing orders. Continue?
es_es: Esto sincronizará los items de todas las órdenes existentes. ¿Continuar?

source: 🔄 Migrate Items Now
es_es: 🔄 Migrar Items Ahora

source: This may take a few seconds depending on the number of orders.
es_es: Esto puede tardar unos segundos dependiendo del número de órdenes.

source: ⏳ Generating Mass Data...
es_es: ⏳ Generando Datos Masivos...

source: Please do not close this tab. Processing
es_es: Por favor no cierres esta pestaña. Procesando

source: of
es_es: de

source: 1. First: Dummy Products
es_es: 1. Primero: Productos Dummy

source: Generates <b>20 Real Products</b>. It is <b>mandatory</b> to have products before simulating sales.
es_es: Genera <b>20 Productos Reales</b>. Es <b>obligatorio</b> tener productos antes de simular ventas.

source: Create 20 Dummy Products?
es_es: ¿Crear 20 Productos Reales?

source: 📦 Generate Products (Step 1)
es_es: 📦 Generar Productos (Paso 1)

source: Orders will use these products.
es_es: Las órdenes usarán estos productos.

source: 2. Second: Mass Load (5k)
es_es: 2. Segundo: Carga Masiva (5k)

source: Generates <b>5,000 Real Orders</b> using products from step 1.
es_es: Genera <b>5,000 Pedidos Reales</b> usando los productos del paso 1.

source: Reflects real load.
es_es: Refleja una carga real.

source: 🚀 Start Mass Load (Step 2)
es_es: 🚀 Iniciar Carga Masiva (Paso 2)

source: Will run in 10 batches of 500.
es_es: Se ejecutará en 10 tandas de 500.

source: 3. Quick Test (50)
es_es: 3. Test Rápido (50)

source: Quick synchronization test with 50 orders (optional).
es_es: Prueba rápida de sincronización con 50 pedidos (opcional).

source: Create 50 Real Orders?
es_es: ¿Crear 50 Pedidos Reales?

source: 🛒 Generate 50 Orders
es_es: 🛒 Generar 50 Pedidos

source: Note: Real orders will appear in "WooCommerce > Orders" and automatically sync with Speed Analytics Dashboard.
es_es: Nota: Las órdenes reales aparecerán en "WooCommerce > Pedidos" y se sincronizarán automáticamente con el Dashboard de Speed Analytics.

source: ⚠️ Danger Zone
es_es: ⚠️ Zona de Limpieza

source: Deletes ALL data generated by this plugin (Flat Table, Dummy Products, Dummy Orders).
es_es: Borra TODOS los datos generados por este plugin (Tabla Plana, Productos Dummy, Órdenes Dummy).

source: ARE YOU SURE? This will delete all generated test data.
es_es: ¿ESTÁS SEGURO? Esto borrará todos los datos de prueba generados.

source: sold
es_es: vendidos

source: No data yet
es_es: Sin datos aún

source: Revenue ($)
es_es: Ingresos ($)
